app/controllers/blocks_controller.rb

SELECT * FROM `blocks`
SELECT * FROM `categories`
---
  def index
    @blocks = Block.all
    @categories = Category.all

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
---
  def show
    @block = Block.find(params[:id])

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
---
  def edit
    @block = Block.find(params[:id])

SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)
UPDATE `blocks` SET `updated_at` = '2010-03-28 15:47:12', `build_date` = '2010-03-28' WHERE `id` = 1
---
  def update
    @block = Block.find(params[:id])
    if @block.update_attributes(params[:block])