app/controllers/block_documents_controller.rb

  def index

	@block = Block.find(params[:block_id])
    @block_documents = @block.block_documents.all
---
SELECT * FROM "blocks" WHERE ("blocks"."id" = 20)
SELECT * FROM "block_documents" WHERE ("block_documents".block_id = 20)
SELECT * FROM `blocks`

  def new
    @block = Block.find(params[:block_id])
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 1)

  def create
    @block = Block.find(params[:block_id])
    @block_document = @block.block_documents.build(params[:block_document])
    if @block_document.save
---
SELECT * FROM `blocks` WHERE (`blocks`.`id` = 13)
INSERT INTO `block_documents` (`name`, `created_at`, `document_file_size`, `updated_at`, `document_file_name`, `block_id`, `document_updated_at`, `category_id`, `expiry_date`, `document_content_type`) VALUES('test3', '2010-03-28 21:29:27', 16171019, '2010-03-28 21:29:27', 'Apress.Beginning.Google.Maps.Applications.with.Rails.and.Ajax.Feb.2007.pdf', 9, '2010-03-28 21:29:25', 2, '2010-03-02', 'application/x-download')